{
  "introductions": {
    "human-fighter": [
      "A seasoned warrior steps forward, sword gleaming in the pale light.",
      "Before you stands a battle-hardened fighter, shield raised and ready.",
      "A noble warrior approaches, their blade singing a deadly promise.",
      "Your opponent moves with practiced grace, a veteran of countless duels.",
      "The warrior's armor bears the marks of many battles survived.",
      "A determined fighter advances, their stance speaking of years of training.",
      "Your adversary carries themselves with the confidence of a true swordmaster.",
      "The challenger's eyes are cold and calculating, sizing you up with precision."
    ],
    "evil-human-fighter": [
      "A dark figure emerges from the shadows, malice burning in their eyes.",
      "Your enemy approaches with cruel intent, their cursed blade thirsting for blood.",
      "A sinister warrior stalks forward, radiating an aura of malevolence.",
      "Before you stands a merciless fighter, their reputation written in scars.",
      "The villain's twisted smile promises nothing but pain and suffering.",
      "A corrupted soul draws near, their weapon stained with the blood of innocents.",
      "Evil incarnate stands before you, eager to add you to their list of victims.",
      "Your foe's laugh echoes with dark promise as they brandish their wicked blade."
    ],
    "goblin-fighter": [
      "A snarling goblin scurries into view, mace clutched in gnarled claws.",
      "Your foe cackles wickedly, green skin glistening with anticipation.",
      "A vicious goblin warrior appears, surprisingly well-armed and dangerous.",
      "The goblin fighter grins with sharp teeth, eager for combat.",
      "A diminutive but deadly creature bounds forth, weapon at the ready.",
      "The goblin's yellow eyes gleam with cunning and bloodlust.",
      "Your green-skinned opponent chitters excitedly, bouncing on clawed feet.",
      "A scrappy goblin warrior charges forward with reckless abandon."
    ]
  },
  "locations": [
    "The abandoned courtyard echoes with your footsteps.",
    "Ancient stone pillars loom over the dueling ground.",
    "A circle of torches illuminates the arena.",
    "Rain begins to fall on the blood-stained cobblestones.",
    "Mist creeps across the forest clearing where you stand.",
    "The setting sun casts long shadows across the battlefield.",
    "A cold wind howls through the mountain pass.",
    "You face each other in the ruins of a forgotten temple.",
    "The tavern empties as the crowd forms a circle around you.",
    "Lightning flashes overhead as storm clouds gather.",
    "Moonlight filters through the canopy of ancient trees above.",
    "The air is thick with tension in this desolate wasteland.",
    "Crumbling statues watch silently as witnesses to the duel.",
    "A bridge over a raging river becomes your battleground.",
    "The sandy arena floor shifts beneath your feet.",
    "Fog rolls in, obscuring all but your immediate surroundings.",
    "The chapel bells toll ominously in the distance.",
    "Snow begins to fall, coating the killing ground in white.",
    "You stand in a narrow alley, escape impossible for the loser.",
    "The throne room's grandeur mocks this brutal confrontation."
  ],
  "ready": [
    "You grip your weapon tightly. There's no turning back.",
    "Your heart pounds. The dance of death begins.",
    "Steel meets steel. May the gods favor the swift.",
    "The air crackles with tension. Only one will walk away.",
    "You steady your breathing. Victory or death awaits.",
    "Your opponent's eyes lock with yours. The duel begins.",
    "Time seems to slow. Every heartbeat could be your last.",
    "The moment of truth has arrived. Draw your blade!",
    "Both fighters settle into their stances. The die is cast.",
    "Silence falls. Only the clash of weapons will break it.",
    "You feel the weight of fate upon your shoulders.",
    "No words remain. Only action will decide this contest.",
    "The final preparations complete, combat is inevitable.",
    "Your muscles tense. In moments, blood will be spilled.",
    "This is it. Everything you've trained for comes down to this.",
    "Two warriors enter. Only one will leave victorious."
  ],
  "roundResults": {
    "bothMiss": [
      "Blades clash harmlessly as you circle each other warily.",
      "Your strikes meet nothing but air as both fighters dodge.",
      "Neither combatant finds an opening in the deadly dance.",
      "Steel rings against steel, but neither blade finds flesh.",
      "You exchange feints and parries, testing each other's defenses.",
      "A moment of tense standoff as you both withdraw to reassess.",
      "Your attacks are perfectly matched, canceling each other out.",
      "Both warriors move with precision, but neither lands a blow.",
      "The deadly ballet continues with no advantage gained.",
      "Weapons clash and separate without drawing blood.",
      "Each fighter's defense proves equal to the other's offense.",
      "You trade near-misses in a display of martial prowess.",
      "The duel remains even as both attacks fail to connect.",
      "Anticipation meets anticipation in this stalemate of skill."
    ],
    "bothMissRestricted": [
      "Both fighters struggle awkwardly, unable to land a clean strike.",
      "Your movements feel sluggish as you both fail to connect.",
      "Neither combatant can capitalize on their compromised positions.",
      "You trade clumsy blows that find only air.",
      "Both fighters are hampered, resulting in a chaotic exchange of misses.",
      "Restrictions plague both warriors, turning the exchange into a fumbling mess.",
      "Your limited options result in predictable attacks that both evade.",
      "Hampered movements lead to a frustrated exchange of failed strikes.",
      "Both combatants stumble through ineffective attacks.",
      "The awkward dance of restricted fighters yields no hits."
    ],
    "playerMissOpponentHits": [
      "Your attack goes wide as your opponent's blade finds its mark!",
      "You're caught off-guard! The enemy's strike lands true.",
      "Your defense falters and you feel the sting of cold steel!",
      "Too slow! Your opponent's weapon crashes into you.",
      "You misjudge the distance and pay the price in blood!",
      "Your enemy reads your move and punishes your mistake!",
      "Pain flares as your opponent's attack cuts through your guard!",
      "Your assault fails while theirs succeeds spectacularly!",
      "A critical error leaves you open to a devastating counter!",
      "Your opponent's timing is perfect, catching you mid-strike!",
      "The enemy's blade slips past your defenses with ease!",
      "Your failed attack leaves you vulnerable to their riposte!",
      "Superior skill shows as your foe turns your aggression against you!",
      "You overextend and suffer the consequences immediately!"
    ],
    "playerMissOpponentHitsRestricted": [
      "Hampered by your position, you fail to defend as the enemy strikes!",
      "Your restricted movement leaves you vulnerable to attack!",
      "You struggle to recover as your opponent capitalizes on your weakness!",
      "Unable to properly defend yourself, you take a punishing blow!",
      "Your compromised stance costs you dearly as their weapon finds you!",
      "Limited options doom you as your opponent strikes freely!",
      "Your restrictions prove fatal as the enemy exploits every weakness!",
      "Hobbled and helpless, you can only watch the attack coming!",
      "Your hampered state makes you easy prey for their assault!",
      "Disadvantage compounds as you fail to counter their strike!"
    ],
    "playerHitsOpponentMiss": [
      "Your blade connects! Your opponent staggers from the impact.",
      "Perfect form! Your strike finds an opening in their defense.",
      "You press the advantage and land a devastating blow!",
      "Your opponent's guard drops and you exploit it ruthlessly!",
      "Your weapon strikes true as your enemy's attack fails!",
      "Speed and skill combine as you outmaneuver your foe!",
      "Your opponent reels as your attack hits home!",
      "A masterful strike catches your enemy completely off-balance!",
      "Your technique proves superior as steel meets flesh!",
      "The enemy's failed attack creates the perfect opening for you!",
      "Your training shows as you land a textbook-perfect hit!",
      "They telegraph their move, allowing you to strike first!",
      "Your weapon finds its mark while theirs finds only air!",
      "Precision and power unite in your successful assault!"
    ],
    "playerHitsOpponentMissRestricted": [
      "You exploit your opponent's compromised position with a brutal strike!",
      "Their awkward stance leaves them open to your devastating attack!",
      "You capitalize on their restriction and land a crushing blow!",
      "Unable to properly defend, your opponent takes the full force of your strike!",
      "Their hampered movement makes them easy prey for your weapon!",
      "You show no mercy, striking while they struggle with limitations!",
      "Their disadvantage becomes your opportunity for a savage hit!",
      "You ruthlessly press the attack against their compromised defense!",
      "Their restrictions prove catastrophic as your blade connects!",
      "You punish their weakened state with a devastating strike!"
    ],
    "bothHit": [
      "Both fighters strike simultaneously in a brutal exchange!",
      "Steel bites flesh on both sides as neither backs down!",
      "You trade blows in a desperate flurry of violence!",
      "Blood flows freely as both combatants land crushing hits!",
      "Neither warrior yields as attacks crash through defenses!",
      "A savage exchange leaves both fighters wounded!",
      "Desperation drives you both to reckless offense!",
      "Mutual aggression results in mutual damage!",
      "Both warriors accept pain to deliver pain in return!",
      "The clash is fierce and bloody on both sides!",
      "Offense trumps defense as both weapons find their targets!",
      "You both land telling blows in the chaotic melee!",
      "A wild exchange sees both fighters drawing blood!",
      "Neither combatant defends, resulting in a brutal double-strike!"
    ],
    "bothHitRestricted": [
      "Despite compromised positions, both fighters land vicious strikes!",
      "Hampered but dangerous, you both draw blood in a wild exchange!",
      "Restrictions be damned—both warriors strike with desperate fury!",
      "Awkward stances can't prevent the brutal carnage of mutual hits!",
      "Both fighters overcome their limitations to land savage blows!",
      "Limited options force both combatants into a head-on collision!",
      "Disadvantages forgotten, both fighters tear into each other!",
      "Restrictions only increase the ferocity of the mutual assault!",
      "Both hampered warriors abandon defense for raw aggression!",
      "Desperation and restriction combine in a bloody exchange!"
    ]
  },
  "moveDescriptions": {
    "close": [
      "The combatants clash at close quarters, breath hot on each other's faces.",
      "Steel scrapes against steel as the fighters grapple at arm's length.",
      "You're close enough to see the fear—or fury—in your opponent's eyes.",
      "The deadly dance brings you within striking distance.",
      "Bodies press close as weapons seek vulnerable flesh.",
      "You can smell your opponent's sweat in this intimate violence.",
      "The fight becomes personal at this brutal range.",
      "Every muscle strains as you battle at arm's reach."
    ],
    "far": [
      "Both fighters maintain distance, circling like wary predators.",
      "You gauge each other from across the arena, weapons raised.",
      "The gap between combatants widens as caution takes hold.",
      "Each warrior retreats to reassess, breathing hard.",
      "You circle at range, looking for an opening to exploit.",
      "Distance provides safety but limits offensive options.",
      "The fighters move cautiously, respecting each other's reach.",
      "Space separates the combatants as they prepare their next moves."
    ]
  },
  "victory": [
    "Your opponent's weapon clatters to the ground as they collapse.",
    "With a final, decisive strike, you end the duel.",
    "Your enemy falls to their knees, defeated and broken.",
    "The clash of steel falls silent. You alone remain standing.",
    "Victory is yours. Your opponent lies motionless at your feet.",
    "Your blade delivers the finishing blow. It is over.",
    "The defeated warrior crumples to the ground in defeat.",
    "You stand triumphant over your fallen adversary.",
    "Your superior skill has won the day. The fight is yours.",
    "The final strike connects. Your opponent falls, vanquished."
  ],
  "defeat": [
    "Your strength fails you. The world spins as you fall.",
    "Through blurred vision, you see your opponent standing victorious.",
    "Your weapon slips from nerveless fingers as darkness takes you.",
    "You stumble backward, unable to continue. The duel is lost.",
    "Pain overwhelms you as your enemy's blade finds its mark one final time.",
    "Your legs give out beneath you as defeat becomes inevitable.",
    "Consciousness fades as you collapse onto the cold ground.",
    "The victor's blade has done its work. You can fight no more.",
    "Your body betrays you, and you fall into darkness.",
    "Defeat tastes bitter as you sink into oblivion."
  ]
}
